![](logo.png)
# Day Objectives
## Pandas
- Pandas is a built in library using for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc.
- Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.
- There are two main data structures in Pandas - Series and Dataframes. The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis.
- Source: https://pandas.pydata.org/pandas-docs/stable/overview.html
## Pandas Series
- A series is similar to a 1-D numpy array, and contains values of the same type (numeric, character, datetime  etc.). A dataframe is simply a table where each column is a pandas series.

## creating series
- List
- Tuple
- Dictionary
- Numpy
- Date_Range
- Series Indexing

## Data Analysis with Pandas
* Pandas DataFrame
* Combining & Merging
* File I/O
* Indexing
* Grouping
* Features
* Filtering
* Sorting
* Statistical
* Plotting
* Saving

|S.No |Name |Gender|
|--|--|--|
|1 | Mercy | Female|
|2 | Cherry | Male |
|3 | Raju | Male |

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\lavan\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\lavan\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\lavan\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [4]:
len(dir(pd))

142

In [5]:
# Pandas series

In [7]:
# creating Pandas series - 1-D data
s1 = pd.Series([1,2,3,4,5,5,6,7])
s1
# numpy and series 
# - Pandas series having Index values 
# always index starts from 0
# we can easly access the data

0    1
1    2
2    3
3    4
4    5
5    5
6    6
7    7
dtype: int64

In [8]:
s2 = pd.Series((12,343,3.445,"string",88j))
s2

0        12
1       343
2     3.445
3    string
4       88j
dtype: object

In [12]:
di = {"name" : "Prasad","Pin":333,"msg":"Yes"}
s3 = pd.Series(di)
s3

name    Prasad
Pin        333
msg        Yes
dtype: object

In [13]:
type(s3)

pandas.core.series.Series

In [15]:
s3.dtype # object - string

dtype('O')

In [16]:
s2

0        12
1       343
2     3.445
3    string
4       88j
dtype: object

In [18]:
s2.index = ["X","Y","Z",12,34.3]
s2
# explicit indexing

X           12
Y          343
Z        3.445
12      string
34.3       88j
dtype: object

In [21]:
li = [123,34,5456,6]
# convert li into numpy
import numpy as np
n = np.array(li)

In [22]:
s4 = pd.Series(n)
s4

0     123
1      34
2    5456
3       6
dtype: int32

# Date_Range

In [24]:
pd.date_range(start="2021-05-31",end="2021-06-30")

DatetimeIndex(['2021-05-31', '2021-06-01', '2021-06-02', '2021-06-03',
               '2021-06-04', '2021-06-05', '2021-06-06', '2021-06-07',
               '2021-06-08', '2021-06-09', '2021-06-10', '2021-06-11',
               '2021-06-12', '2021-06-13', '2021-06-14', '2021-06-15',
               '2021-06-16', '2021-06-17', '2021-06-18', '2021-06-19',
               '2021-06-20', '2021-06-21', '2021-06-22', '2021-06-23',
               '2021-06-24', '2021-06-25', '2021-06-26', '2021-06-27',
               '2021-06-28', '2021-06-29', '2021-06-30'],
              dtype='datetime64[ns]', freq='D')

# Series Indexing

In [28]:
s1[4]

5

In [29]:
s3

name    Prasad
Pin        333
msg        Yes
dtype: object

In [30]:
s3["Pin"]

333

In [31]:
s3["name"]

'Prasad'

In [32]:
s1[::2]

0    1
2    3
4    5
6    6
dtype: int64

In [33]:
s1[::-1]

7    7
6    6
5    5
4    5
3    4
2    3
1    2
0    1
dtype: int64

In [34]:
s1[1::2]

1    2
3    4
5    5
7    7
dtype: int64

In [36]:
di = {"name" : "Prasad","Pin":333,"Branch":np.nan,"msg":"Yes"}
s3 = pd.Series(di)
s3
# nan - not a number  - special type of float value

name      Prasad
Pin          333
Branch       NaN
msg          Yes
dtype: object

In [37]:
# Updating
s3["Branch"]

nan

In [38]:
s3["Branch"]  = "Mech"
s3

name      Prasad
Pin          333
Branch      Mech
msg          Yes
dtype: object

In [39]:
s5 = pd.Series("Mech",index = [333,323,435,235,2342])
s5

333     Mech
323     Mech
435     Mech
235     Mech
2342    Mech
dtype: object

# Task
- create Series having index values starts from 10 to 20 and the values are squares of index values

In [46]:
s = pd.Series(np.arange(10,21)**2 , index = np.arange(10,21))
s
# length of the series and length of the index values should be equal

10    100
11    121
12    144
13    169
14    196
15    225
16    256
17    289
18    324
19    361
20    400
dtype: int32

In [49]:
s1

0    1
1    2
2    3
3    4
4    5
5    5
6    6
7    7
dtype: int64

In [50]:
#  to get  particular index values 1,3,7,5
# Fancy Indexing
s1[[1,3,7,5]]

1    2
3    4
7    7
5    5
dtype: int64

In [51]:
s3

name      Prasad
Pin          333
Branch      Mech
msg          Yes
dtype: object

In [54]:
s3[0] # implict Indexing

'Prasad'

In [53]:
s3["name"] # explict indexing

'Prasad'

In [55]:
s3[["name"]] # fancy indexing

name    Prasad
dtype: object

In [56]:
li = [i*i for i in range(10,21)]
np.array(li)
s10 = pd.Series(li, index=[10,11,12,13,14,15,16,17,18,19,20])
s10

10    100
11    121
12    144
13    169
14    196
15    225
16    256
17    289
18    324
19    361
20    400
dtype: int64

# Pandas DataFrames

In [57]:
# creating DataFrame using List
df1 = pd.DataFrame([[1,2,3,4,4,4],[12,34,45,65,67,32]])
df1

    0   1   2   3   4   5
0   1   2   3   4   4   4
1  12  34  45  65  67  32

In [58]:
# using Tuples 
df2 = pd.DataFrame(((1,2,3,4,4,4),(12,34,45,65,67,32)))
df2

    0   1   2   3   4   5
0   1   2   3   4   4   4
1  12  34  45  65  67  32

In [59]:
di

{'name': 'Prasad', 'Pin': 333, 'Branch': nan, 'msg': 'Yes'}

In [64]:
df3 = pd.DataFrame(di, index = [1,2])
df3

     name  Pin  Branch  msg
1  Prasad  333     NaN  Yes
2  Prasad  333     NaN  Yes

In [65]:
df3.index

Int64Index([1, 2], dtype='int64')

In [66]:
df3.columns

Index(['name', 'Pin', 'Branch', 'msg'], dtype='object')

In [68]:
df3.shape # rows,columns

(2, 4)

In [74]:
di1 = {"Name" : ["Prasad","sravani","latha","lavanya"],
       "Pin":[333,444,777,656],
       "Branch":["Mech","CSE","IT","ECE"]  
}

In [75]:
df4 = pd.DataFrame(di1)

In [76]:
df4

      Name  Pin Branch
0   Prasad  333   Mech
1  sravani  444    CSE
2    latha  777     IT
3  lavanya  656    ECE

In [77]:
df4.shape

(4, 3)

In [78]:
df4.index

RangeIndex(start=0, stop=4, step=1)

In [79]:
df4["Name"]  # accessing sub df - series

0     Prasad
1    sravani
2      latha
3    lavanya
Name: Name, dtype: object

In [80]:
df4["Branch"] # 1-D data

0    Mech
1     CSE
2      IT
3     ECE
Name: Branch, dtype: object

In [82]:
df4[["Name","Branch"]] # 2-D sub df

      Name Branch
0   Prasad   Mech
1  sravani    CSE
2    latha     IT
3  lavanya    ECE

In [83]:
# get sravani's Pin number
df4["Name"]

0     Prasad
1    sravani
2      latha
3    lavanya
Name: Name, dtype: object

In [85]:
df4["Pin"][1]

444

In [87]:
df4

      Name  Pin Branch
0   Prasad  333   Mech
1  sravani  444    CSE
2    latha  777     IT
3  lavanya  656    ECE

# Indexing and Slicing

In [90]:
df4[:1]

     Name  Pin Branch
0  Prasad  333   Mech

In [93]:
df4[2:3]

    Name  Pin Branch
2  latha  777     IT

In [94]:
df4[0]

KeyError: 0

In [96]:
df4[::2]

     Name  Pin Branch
0  Prasad  333   Mech
2   latha  777     IT

In [98]:
len(li)

11

In [105]:
df5 = pd.DataFrame(li, index = list("abcdefghije"))
df5

     0
a  100
b  121
c  144
d  169
e  196
f  225
g  256
h  289
i  324
j  361
e  400

In [106]:
df4

      Name  Pin Branch
0   Prasad  333   Mech
1  sravani  444    CSE
2    latha  777     IT
3  lavanya  656    ECE

In [107]:
df4["Branch"] # as series

0    Mech
1     CSE
2      IT
3     ECE
Name: Branch, dtype: object

In [108]:
df4[["Branch"]]

  Branch
0   Mech
1    CSE
2     IT
3    ECE

In [109]:
df4["%"] = [90,98,89,78]
df4

      Name  Pin Branch   %
0   Prasad  333   Mech  90
1  sravani  444    CSE  98
2    latha  777     IT  89
3  lavanya  656    ECE  78

In [112]:
df4.set_index("Name")

         Pin Branch   %
Name
Prasad   333   Mech  90
sravani  444    CSE  98
latha    777     IT  89
lavanya  656    ECE  78

In [113]:
df4

      Name  Pin Branch   %
0   Prasad  333   Mech  90
1  sravani  444    CSE  98
2    latha  777     IT  89
3  lavanya  656    ECE  78

In [114]:
df4.set_index("Name", inplace = True)

In [115]:
df4

         Pin Branch   %
Name
Prasad   333   Mech  90
sravani  444    CSE  98
latha    777     IT  89
lavanya  656    ECE  78

In [120]:
df4.reset_index(inplace=True)

In [128]:
df4[2:3][["Name","Branch"]]

    Name Branch
2  latha     IT

## iloc -- for accessing rows using integer indicies
## loc -- for accessing rows other than integer indicies

In [129]:
df4.iloc[2]

Name      latha
Pin         777
Branch       IT
%            89
Name: 2, dtype: object

In [131]:
df4.iloc[0]

Name      Prasad
Pin          333
Branch      Mech
%             90
Name: 0, dtype: object

In [132]:
df4.iloc[1:5:2]

      Name  Pin Branch   %
1  sravani  444    CSE  98
3  lavanya  656    ECE  78

In [137]:
df4.loc[3,["Pin","Name"]]

Pin         656
Name    lavanya
Name: 3, dtype: object

In [138]:
df4.loc[[2,1],["Name","%"]]

      Name   %
2    latha  89
1  sravani  98

In [143]:
df4.iloc[3]

Name      lavanya
Pin           656
Branch        ECE
%              78
Name: 3, dtype: object

In [144]:
df4.loc[3]

Name      lavanya
Pin           656
Branch        ECE
%              78
Name: 3, dtype: object

In [145]:
df4.loc[2,"Pin"]

777

# File reading